#Область ПрограммныйИнтерфейс
//++ Юсупов Хайдар №1 
//@skip-check doc-comment-parameter-section
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма); //Юсупов Хайдар №2  
		ДобавитьГруппуСкидки(Форма);  //Юсупов Хайдар №5
		ДобавитьПолеСогласованнаяСкидка(Форма); //Юсупов Хайдар №6
		ДобавитьКнопкуКомандуПрименитьСкидку(Форма); //Юсупов Хайдар №7
		УбратьСкидку(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоПередОснованием(Форма); //Юсупов Хайдар №4	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма); //Юсупов Хайдар №3
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма); //Юсупов Хайдар №2
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
	    ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма); //Юсупов Хайдар №2
	КонецЕсли;
	
КонецПроцедуры //-- Юсупов Хайдар №1

//++ Юсупов Хайдар №2 
//@skip-check module-structure-method-in-regions
Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма)
	
	ЭлементВводаКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ЭлементВводаКонтактноеЛицо.ПутьКДанным = "Объект.ЮХ_КонтактноеЛицо";
	ЭлементВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры //-- Юсупов Хайдар №2

//++ Юсупов Хайдар №3 
//@skip-check module-structure-method-in-regions
Процедура ДобавитьПолеКонтактноеЛицоПередСуммаДокумента(Форма)
	
	ЭлементВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ЭлементВводаКонтактноеЛицо.ПутьКДанным = "Объект.ЮХ_КонтактноеЛицо";
	ЭлементВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры //-- Юсупов Хайдар №3

//++ Юсупов Хайдар №4
//@skip-check module-structure-method-in-regions
Процедура ДобавитьПолеКонтактноеЛицоПередОснованием(Форма)
	
	ЭлементВводаКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.Основание);
	ЭлементВводаКонтактноеЛицо.ПутьКДанным = "Объект.ЮХ_КонтактноеЛицо";
	ЭлементВводаКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры //-- Юсупов Хайдар №4

//++ Юсупов Хайдар №5 
//@skip-check module-structure-method-in-regions
Процедура ДобавитьГруппуСкидки(Форма)

	ГруппаСкидки = Форма.Элементы.Вставить("ГруппаСкидки", Тип("ГруппаФормы"),,Форма.Элементы.Страницы);
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидки.ОтображатьЗаголовок = Ложь;

КонецПроцедуры //-- Юсупов Хайдар №5

//++ Юсупов Хайдар №6 
//@skip-check module-structure-method-in-regions
Процедура ДобавитьПолеСогласованнаяСкидка(Форма)

	ЭлементСогласованнаяСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки);
	ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.ЮХ_СогласованнаяСкидка";
	ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ЮХ_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры //-- Юсупов Хайдар №6

//++ Юсупов Хайдар №7 
//@skip-check module-structure-method-in-regions
Процедура ДобавитьКнопкуКомандуПрименитьСкидку(Форма)
	
	КомандаПрименитьСкидку = Форма.Команды.Добавить("КомандаПрименитьСкидку");
	КомандаПрименитьСкидку.Заголовок = "Применить скидку";
	КомандаПрименитьСкидку.Действие = "ЮХ_ПрименитьСкидку";
	
	КнопкаПрименитьСкидку = Форма.Элементы.Добавить("ПрименитьСкидку", Тип("КнопкаФормы"),Форма.Элементы.ГруппаСкидки);
	КнопкаПрименитьСкидку.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаПрименитьСкидку.ИмяКоманды = "КомандаПрименитьСкидку";	

КонецПроцедуры //-- Юсупов Хайдар №7
// 
//++ Юсупов Хайдар
//@skip-check module-structure-method-in-regions
Процедура УбратьСкидку(Форма)
	
	Форма.Элементы.ТоварыСкидка.Видимость = Ложь;
	Форма.Элементы.УслугиСкидка.Видимость = Ложь;
	
КонецПроцедуры //-- Юсупов Хайдар №7
#КонецОбласти
